Biglang nagising si Kufei Yang sa katawan ni Liangxio sa isang silid-aralan habang tumatanggap ng lecture, nakita niya ang rebulto ng kanyang sarili sa labas ng bintana at nagsimulang magtaka kung siya ay muling nagkatawang-tao 15 taon na ang nakakaraan mula noong siya ay namatay ang propesor ay nagtanong sa kanya at siya ay nabigo. na ang isang nangungunang ranggo 9 na alchemist sa kontinente ay tinatanong ng ganoong pangunahing tanong habang walang nakakaalam na siya iyon dahil kakagising lang niya sa katawan ng isang batang lalaki. nagbigay siya ng sagot at nabigla ang propesor ngunit ang buong klase ay nagsimulang umulan ng insulto sa kanya dahil malinaw na tamang sagot ang nakasulat sa aklat-aralin subalit kinumpirma ng propesor na siya ay tama at nagtataka siya kung paano niya nalaman ang impormasyon na hindi kasama sa ang aklat-aralin sinimulan niyang pag-isipan na ang kanyang talento ay maaaring nasa alchemy kumpara sa kawalan ng kakayahan na kilala siya sa martial arts dahil sa kanyang mga saradong chakras pagkatapos ay nagtanong siya sa kanya ng ilang iba pang mas mahihirap na mga tanong at sinagot niya ang mga ito nang napakadali na nakakuha pa siya ng mga solusyon sa ilan sa ang mga paghihirap ni Steavan na mabilis siyang umalis sa klase at lahat ay nagsimulang magtaka kung biglang naging matalino si Li Yangxio pumunta siya sa Alchemist Tower para makita si Yang Ding na dati niyang alagad para matulungan niya itong ayusin ang kanyang mahinang kasalukuyang katawan sa pagpasok sa tore na nakasalubong niya. ang receptionist at hiningi si Yang D ngunit sa kasamaang palad ay sinabi sa kanya na si Yang D ang dating chairman ng asosasyon ay tumigil sa pagtatrabaho doon 20 taon na ang nakakaraan gusto ni li nunchio na gumawa siya ng ilang mga tabletas. para sa kanya upang magamit niya ang mga ito sa pagbubukas ng kanyang mga chakra ngunit ngayon ay kailangan niyang gumawa ng paraan upang gawin ito nang mag-isa pagkatapos ay sinabi niya sa receptionist ang isang listahan ng ilang mga materyales na kakailanganin niya gayunpaman si Girong isang rank 1 alchemist ay humarang sa kanila at sinabihan ang receptionist na pumunta at alagaan ang isang tao na tinitingnan niya ang listahan at itinapon ito na parang basura pagkatapos ay sinabihan niya si Li Youngxio na umalis dahil ang Alchemist Tower ay hindi isang lugar para sa mga bata ngunit nakita ni liangxio na sinabi ni Jirong Kamakailan lamang ay naging alchemist sa pamamagitan ng ilang mga shortcut na ginawa niya para makapasa siya sa alchemist exam Nagulat si Girong ngunit hindi siya pinapansin gayunpaman binigyan niya ito ng pansin at nagsimulang magmakaawa sa kanya nang sabihin sa kanya ni yungxio ang kahihinatnan at kung paano niya nalaman ang solusyon dito ay nabigla ang lahat. upang makita ang isang alchemist na yumuyuko sa isang batang lalaki na si Lai Nungxio ay nagsabi sa kanya na hanapin at dalhin ang 10 batch ng bawat item sa listahan sa kanya sa akademya ang receptionist ay nag-ulat ng kaganapan kay Lord Lang isang Rank 2 alchemist na hinihiling niyang suriin ang listahan sa mga bagay na hiniling ng batang lalaki at nabigla siya na hindi niya alam ang ilan sa mga materyales na nakalista sa tingin niya ay napakahalaga nito at sinabihan ang receptionist na itago si Li Yangxio sa lahat ng paraan at ipaalam kaagad sa kanya sa susunod na pagdating niya. Naglalakad si liangxio sa kalye sa kadahilanang kailangan niyang humanap ng ibang paraan dahil mahihirapan si Jirong na mahanap ang mga halamang gamot, tiningnan niya ang storage ring ng bata at nakakita ng kapaki-pakinabang. armas ang isang espada na magagamit niya bago niya buksan ang kanyang mga chakra habang papalapit siya sa gate ng akademya siya ay inatake ng dalawang lalaki na sina Dufeng at Lu Ji Henbi at Shenzhen habang ang mga matalik na kaibigan ni Yangxio ay biglang lumitaw din upang ipagtanggol siya habang nakikipaglaban sila Lu Ji nabali ang braso ng Handbag gayunpaman, lumilitaw na ipinagtanggol din ni Prinsesa Kinruksu si Li Yungxio at nagpasya ang dalawang lalaki na parangalan ang prinsesa at umalis nang umalis sila. ang pag-iwan kay Dufeng paralisado ay sinubukan din siyang atakehin ni Lo Ji at natanggap din niya ang kanyang fairshare nagulat din ang mga kaibigan ni Liuncio dito at tinanong nila siya kung nagkataon bang nabuksan niya ang kanyang mga chakra sa kanyang mga kaibigan at nagsimulang matakot ang prinsesa sa landfi na iyon na nagbukas sa pito. chakras at halos masira hanggang sa kaharian ng isang marital warrior na maghihiganti sa kanya dahil sina Dufang at Mu Ji ang kanyang mga alipin habang si yangxio ay nakarating sa kanyang silid at isinasaalang-alang na ang kanyang katawan ay masyadong mahina ay nagpasya siyang magsanay upang palakasin ang kanyang katawan upang mabawi ang kanyang katawan. closed chakras nagpasya siyang magsanay ng tarant body tempering technique na nakuha niya mula kay Aochang Kong ang pinakamalakas sa 10 Marshal sovereigns na nakuha niya ang cultivatio